Revit 2026 API

# PolylineNode Class

---

An output node that represents a 3D polyline.

SystemObject Autodesk.Revit.DBRenderNode Autodesk.Revit.DBModelCurveNode Autodesk.Revit.DBPolylineNode

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class PolylineNode : ModelCurveNode
```
```vb
Public Class PolylineNode
	Inherits ModelCurveNode
```
```cpp
public ref class PolylineNode : public ModelCurveNode
```
```fsharp
type PolylineNode =
    class
        inherit ModelCurveNode
    end
```

The PolylineNode type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from RenderNode) |
|  | LineProperties | Access to the line (pen) properties of the curve being drawn (Inherited from ModelCurveNode) |
|  | NodeName | A readable name of the output node. (Inherited from RenderNode) |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | (Inherited from RenderNode) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetPolyline | Returns the polyline object corresponding to the node. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

See also: [!:Autodesk::Revit::DB::IModelExportContext::OnPolyline].

#### Reference

Autodesk.Revit.DB Namespace